import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import { NavController } from '@ionic/angular';


@Component({
  selector: 'app-h3-travel-aec',
  templateUrl: './h3-travel-aec.page.html',
  styleUrls: ['./h3-travel-aec.page.scss'],
})
export class H3TravelAecPage implements OnInit {
  namecountry: String;

  listAEC: {
    nationalFlag: String,
    logo1: String,
    title1: String,
    discription1: String,
    logo2: String,
    title2: String,
    discription2: String,
    credit: String,
  };

  constructor(public navCtrl: NavController, public actroute: ActivatedRoute) { }

  ngOnInit() {
    sendAEC: String;

    let sendAEC = this.actroute.snapshot.paramMap.get('sendAEC');
    console.log(sendAEC);


    if (sendAEC == 'Brunei Darussalam') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b1_5.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000027591714_Small.jpg',
        title1: '1. มัสยิดโอมาร์ อาลี ไซฟัดดิน',
        discription1: '     มัสยิดโอมาร์ อาลี ไซฟัดดิน มัสยิดอันเก่าแก่ ตั้งอยู่ใจกลางกรุงบันดาร์เสรีเบกาวัน มัสยิดหลังนี้ออกแบบและดำเนินการสร้างโดยสุลต่านโอมาร์ อาลี ไซฟัดดินที่ 3 พระราชบิดาของสุลต่านองค์ปัจจุบัน โดยสร้างเสร็จในปี ค.ศ.1958 พระองค์ทรงได้รับการยกย่องว่าเป็นสถาปนิกสมัยใหม่ของบรูไน มัสยิดนี้มีความวิจิตรงดงามจนได้ชื่อว่า "มินิ ทัชมาฮาล" ',
        logo2: 'https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/10/2.jpg',
        title2: '2. อิสตานา นูรุล อิมาน',
        discription2: '     ยิ่งกว่าอลังการงานสร้าง ก็อลังการพระราชวังสร้าง กับ "อิสตานา นูรุล อิมาน" พระราชวังที่ได้รับการยกย่องว่าใหญ่ที่สุดในโลก ซึ่งใหญ่กว่าพระราชวังบักกิ้งแฮม 3 เท่า และพระราชวังแวร์ซาย 4 เท่า ภายในถูกตกแต่งด้วยความประณีตงดงามจากวัสดุชั้นเลิศและของที่ขาดไม่ได้อย่างทองคำ ซึ่งประกอบไปด้วยห้องต่างๆ 1,788 ห้อง, ห้องน้ำ 257 ห้อง และสระน้ำ 5 สระ นอกจากนี้ ยังมีห้องจัดเลี้ยงขนาดใหญ่ซึ่งบรรจุคนได้มากถึง 5,000 คน ยัง ยัง ไม่จบที่นี่ยังมี Ferrari และ Rolls Royces ที่สั่งทำพิเศษคันเดียวในโลก, เครื่องบินโบอิ้ง 747-400 มูลค่ากว่า 200 ล้านดอลลาร์ ',
        credit : 'Credit : ' + 'kabarmakkah.com'
      }
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Cambodia') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b2_7.jpg',
        logo1: 'http://travel.mthai.com/app/uploads/2015/06/DSC_31581-e1433848408786.jpg',
        title1: '1. อังกอร์วัด',
        discription1: 'อังกอร์วัด คือสิ่งปลูกสร้างทางศาสนาที่ใหญ่ที่สุดในโลก สร้างในปี พ.ศ.1650 ในสมัยของพระเจ้าสุริยวรมัน ที่ 2 ตัวเทวสถานถือเป็นที่สุดของสถาปัตยกรรมเขมรคลาสสิก และได้กลายมาเป็นสัญลักษณ์ของประเทศกัมพูชา โดยปรากฏในธงชาติ และเป็นจุดท่องเที่ยวหลักของประเทศ ตลอดจนได้รับลงทะเบียนเป็นมรดกโลกภายใต้ชื่อ นครวัด-นครธม',
        logo2: 'http://travel.mthai.com/app/uploads/2015/06/DSC_2898-e1434097359773.jpg',
        title2: '2. ปราสาทบายน',
        discription2: 'ปราสาทบายน ปราสาทที่ศักดิ์สิทธิ์ที่สุดในอาณาจักรขอม สร้างขึ้นในสมัยของพระเจ้าชัยวรมันที่ 7 ในปี พ.ศ. 1730 ปราสาทบายน เป็นศาสนสถานของพระพุทธศาสนา นิกายวัชรยาน มีรูปสลักของพระเจ้าชัยวรมันที่ 7 รอบปราสาท มี ทั้งหมด 54 ยอด 216 หน้า',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      }
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Indonesia') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b3_4.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000017571255_Small.jpg',
        title1: '1. วิหารอูลันดานูบราตัน',
        discription1: 'วิหารอูลันดานูบราตัน ตั้งอยู่บริเวณกลางน้ำริมทะเลสาบบราตัน มีฉากหลังเป็นภูเขาไฟสูงทะมึน บางช่วงถูกคั่นด้วยปุยเมฆสีขาว วัดนี้สร้างตั้งแต่สมัยศตวรรษที่ 17 เพื่อใช้ทำพิธีทางศาสนาพุทธและฮินดู รวมทั้งอุทิศแด่เทวี ดานู เทพยแห่งสายน้ำ ไม่สามารถเดินข้ามไปยังวัดได้ มีลักษณะเด่นตรงศาลาซึ่งมีหลังคาทรงสูงที่รียกว่าเมรุ มุงด้วยฟางซ้อนกันถึง 11 ชั้น สวยงามมากมักปรากฏอยู่ในภาพถ่ายโฆษณาการท่องเที่ยวของบาหลีเสมอ',
        logo2: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000009679195_Small.jpg',
        title2: '2. ภูเขาไฟโบรโม่',
        discription2: 'ภูเขาไฟโบรโม่ ได้ชื่อว่าเป็นอัญมณีบนมงกุฎของชวาตะวันออก อีกทั้งที่นี่ยังถูกจัดอันดับให้เป็นหนึ่งในสิ่งมหัศจรรย์ของเอเชียตะวันออกเฉียงใต้อีกด้วย โดยภูเขาไฟโบรโม่คือหนึ่งในภูเขาไฟที่ยังดับไม่สนิทจาภูเขาไฟทั้งหมดประมาณ 400 ลูกของอินโดนีเซีย ที่มีความสูงเหนือระดับน้ำทะเลถึง 2,392 เมตร ซึ่งเคยเกิดระเบิดมาแล้วถึง 3 ครั้ง ภายในระยะเวลาเกือบ 30 ปีที่ผ่านมา นอกจากนี้มันยังเป็นสถานที่ท่องเที่ยว 1 ใน 10 แห่งอินโดนีเซียที่นักท่องเที่ยวไม่ควรพลาดอีกด้วย',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Lao') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b4_5.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000011227262_Small.jpg',
        title1: '1. วังเวียง',
        discription1: 'วังเวียง เมืองแห่งมนต์เสน่ห์ ได้ขึ้นชื่อว่าเป็นกุ้ยหลินเมืองลาว เพราะเต็มไปด้วยหุบเขา ถ้ำ สายน้ำ และผืนป่าอันอุดมสมบูรณ์ นักท่องเที่ยวจะได้สัมผัสธรรมชาติในรูปแบบการผจญภัยต่าง ๆ อย่างใกล้ชิด',
        logo2: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000057679524_Small.jpg',
        title2: '2. น้ำตกตาดกวางสี',
        discription2: 'น้ำตกตาดกวางสี น้ำตกที่สวยงามที่สุดของเมืองหลวงพระบาง เป็นน้ำตกหินปูน สูงราว 70 เมตรมีสองชั้น สภาพป่าร่มรื่น มีสะพานและเส้นทางเดินชมรอบๆน้ำตกและสามารถเลาะข้างน้ำตกไปชมน้ำตกชั้นบนสามมารถเล่นน้ำบริเวณลำธารได้',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Malaysia') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b5_4.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000064684333_Small.jpg',
        title1: '1. เกาะปีนัง',
        discription1: 'เกาะปีนัง เป็น 1 ใน 13 รัฐของมาเลเซีย ซึ่งตั้งอยู่ทางชายฝั่งตะวันตก และมีจอร์จทาวน์เป็นเมืองหลวงของรัฐ ส่วนในเรื่องของการท่องเที่ยว ที่ปีนังคุณสามารถหาสถานที่ท่องเที่ยวสวย ๆ ได้มากมาย เนื่องจากที่ปีนังนั้นถือว่ามีความหลากหลายทางด้านสถานที่ท่องเที่ยวทั้งจากแหล่งประวัติศาสตร์และธรรมชาติที่สวยงาม',
        logo2: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000064226541_Small.jpg',
        title2: 'ซาบาห์',
        discription2: 'ซาบาห์เป็นหนึ่งในสองรัฐของมาเลเซียบนเกาะบอร์เนียว ตั้งอยู่ทางภาคตะวันออกเฉียงเหนือของเกาะ มีภูมิประเทศเป็นเทือกเขาสูง และมีทรัพยากรทางทะเลที่สวยงามและสมบูรณ์มาก โดยมีโกตาคินาบาลู เป็นเมืองหลวงของรัฐ',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }
    else if (sendAEC == 'Myanmar') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b6_3.jpg',
        logo1: 'http://travel.mthai.com/app/uploads/2015/06/1424055292-21308C0285-o-e1434093654942.jpg',
        title1: '1. เจดีย์ชเวดากอง',
        discription1: 'เจดีย์ชเวดากอง แลนด์มาร์กสำคัญของเมียนมาร์ ตั้งอยู่ที่เมืองย่างกุ้ง เมืองหลวงเก่า โดดเด่นด้วยเจดีย์ใหญ่สีทองอร่าม เป็นสถานที่สำคัญทางพระพุทธศาสนา และเป็นศูนย์รวมจิตใจของชาวเมียนมาร์เลยก็ว่าได้',
        logo2: 'http://travel.mthai.com/app/uploads/2015/06/1424052720-508C90494-o-e1434093643226.jpg',
        title2: '2. พุกาม',
        discription2: 'พุกาม เมืองแห่งทะเลเจดีย์ เต็มไปด้วยเจดีย์ และวัดเก่าแก่ ตั้งเรียงรายละลานตา เต็มไปด้วยประวัติศาสตร์และวัฒนธรรมอันเก่าแก่ อีกทั้งยังมีเทศกาลบอลลูนให้นักท่องเที่ยวได้ขึ้นไปชมวิวของเมืองแบบ 360 องศา อีกด้วย',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Philippines') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b7_3.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000022896835_Small.jpg',
        title1: '1. ช็อคโกแลตฮิลส์',
        discription1: 'ช็อคโกแลตฮิลส์ ตั้งอยู่บนเกาะโบฮอล ทางตอนใต้ของกรุงมะนิลา คือเนินเขาลูกย่อม ๆ ทรงกรวยคว่ำ ที่มีลักษณะค่อนข้างสมมาตร เรียงกันเป็นบริเวณกว้าง ครอบคลุมพื้นที่กว่า 50 ตารางกิโลเมตร คาดว่ามีจำนวน 1,260 ถึง 1,776 ลูก ความสูงโดยเฉลี่ยของเนินเหล่านี้อยู่ที่ 30-50 เมตร เป็นภาพที่แสนมหัศจรรย์',
        logo2: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000040221568_Small.jpg',
        title2: '2. เกราะโบราไกย์',
        discription2: 'โบราไกย์ คือเกาะหนึ่งในประเทศฟิลิปปินส์ อยู่ห่างจากกรุงมะนิลาไปทางทิศใต้ประมาณ 315 กิโลเมตร เป็นสถานที่ท่องเที่ยวที่มีชื่ออย่างมาก โดยเฉพาะในปี ค.ศ. 2012 เกาะแห่งนี้ได้รับการโหวตจากนิตยสารทราเวล + เลเชอร์ ให้เป็นสถานที่ท่องเที่ยวอันดับหนึ่งของโลกมาแล้ว  นอกจากนี้ยังได้รับเลือกให้เป็นจุดมุ่งหมายปลายทางที่สงบเงียบและเป็นแหล่งบันเทิงยามราตรีที่ยอดเยี่ยม อีกด้วย',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Singapore') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b8_2.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000064567227_Small.jpg',
        title1: '1. มารีน่า เบย์ แซนด์',
        discription1: 'มารีน่า เบย์ แซนด์ โรงแรมระดับ 5 ดาว ได้ชื่อว่าอลังการที่สุดในสิงคโปร์ จำนวนห้องพักกว่า 2500 ห้อง ในความสูง 57 ชั้น โดยมีจุดเด่นอยู่บนชั้นดาดฟ้า Skypark ที่มีสระว่ายน้ำไร้ขอบ ยาวถึง 150 เมตร และใกล้ๆ กันมี ไนท์คลับ สุดฮิป ไว้ให้บริการด้วย ซึ่งนักท่องเที่ยวจะได้สนุกพร้อมกับชมวิวทั้งเมืองในยามค่ำคืน',
        logo2: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000033821442_Small-e1434100456381.jpg',
        title2: '2. ชางงี บีช ปาร์ค',
        discription2: 'ชางงี บีช ปาร์ค คือสวนสาธารณะริมชายฝั่งทะเลที่เก่าแก่ที่สุดในสิงคโปร์ นอกจากนั้นที่นี่ยังเป็นสถานที่ยอดนิยมสำหรับการพักผ่อนของครอบครัวในวันหยุดสุดสัปดาห์ ไม่ว่าจะเป็นปิกนิกและสนุกกับการตกปลา ว่ายน้ำ ชมพระอาทิตย์ขึ้นและตกดิน เป็นต้น เนื่องจากที่นี่ค่อนข้างเงียบสงบหากเทียบกับแหล่งอื่น ๆ ของสิงคโปร์',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Thailand') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b9_4.jpg',
        logo1: 'https://cms.dmpcdn.com/travel/2017/08/03/dbdabd7b-cbd8-4f36-b4f1-05fd51055d0c.jpg',
        title1: '1. วัดพระเเก้ว กรุงเทพฯ',
        discription1: 'วัดคู่บ้านคู่เมืองของประเทศไทย และกรุงรัตนโกสินทร์ ก็คือที่นี่ค่ะ วัดพระศรีรัตนศาสดาราม หรือ วัดพระเเก้ว เป็นวัดในพระบรมมหาราชวังเช่นเดียวกับวัดพระศรีสรรเพชญ์ ซึ่งเป็นวัดในพระราชวังหลวงในสมัยอยุธยา    นอกจากนี้ภายในวัดพระศรีรัตนศาสดารามเป็นที่ประดิษฐาน พระพุทธมหามณีรัตนปฏิมากร หรือพระแก้วมรกต ที่นำมาจากกรุงเวียงจันทน์ เป็นวัดหลวงที่สำคัญในพระราชพิธีต่างๆ และยังเป็นแหล่งท่องเที่ยวที่สำคัญของประเทศไทยเราอีกด้วย',
        logo2: 'https://cms.dmpcdn.com/travel/2017/08/03/bca0f0a8-248b-42e2-9c0d-1a0e8213ceda.jpg',
        title2: '2. ทองผาภูมิ กาญจนบุรี',
        discription2: ' อำเภอทองผาภูมิ จังหวัดกาญจนบุรี หนึ่งในที่เที่ยวที่สุดของนักท่องเที่ยวสายผจญภัย ให้ทุกคนได้มาใกล้ชิดธรรมชาติ และชมความงดงามแห่งขุนเขา ทองผาภูมิ มีที่เที่ยวมากมาย ทั้ง อุทยานแห่งชาติท่องผาภูมิ เหมืองปิล๊อก เขื่อนเขาแหลม น้ำตกผาตาด รวมถึง เขาช้างเผือก ที่โด่งดัง ที่หลายคนแค่ได้ไปยืนสูดอากาศดีๆ อยู่บนยอดเขาก็ฟินสุดๆ แล้ว แม้จะต้องจองคิวเข้าอุทยานฯ กันข้ามเดือนข้ามปีก็ตาม ',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Vietnam') {
      this.listAEC = {
        nationalFlag: 'http://hilight.kapook.com/img_cms2/user/pree/b10_1.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000028640536_Small.jpg',
        title1: '1. ฮาลอง เบย์',
        discription1: 'สถานที่ท่องเที่ยวอันเป็นมรดกโลกทางธรรมชาติ มีชื่อเสียงโด่งดังไปทั่วโลก นอกจากจะได้ล่องเรือชมวิวทิวทัศน์อันสุดยอดแล้ว คุณจะได้พบกับกิจกรรมผจญภัยต่าง ๆ ไม่ว่าจะเป็นปีนหน้าผา หรือพายเรือคายัค',
        logo2: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000019188398_Small.jpg',
        title2: '2. ซาปา',
        discription2: 'เป็นอีกแหล่งท่องเที่ยวทางธรรมชาติที่มีความสวยงาม อยู่ทางทิศตะวันตกเฉียงเหนือของเวียดนาม เต็มไปด้วยนาขั้นบันไดสุดลูกหูลูกตา คนชอบถ่ายภาพจะต้องถูกใจแน่นอน อีกทั้งยังได้สัมผัสวิถีวิตของคนท้องถิ่นอีกด้วย',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }

    else if (sendAEC == 'Timor-Leste') {
      this.listAEC = {
        nationalFlag: 'https://s.isanook.com/ca/0/ud/199/997583/r_25328.jpg',
        logo1: 'https://travel.mthai.com/app/uploads/2015/06/iStock_000020914221_Small.jpg',
        title1: '1. กรุงดีลี',
        discription1: 'ติมอร์ เลสเต เป็นประเทศที่เพิ่งประกาศเอการาชได้ประมาณสิบปีที่ผ่านมา เคยตกเป็นอาณานิคมของโปรตุเกส และเคยเป็นส่วนหนึ่งของประเทศอินโดนีเซีย มีเมืองหลวงชื่อว่ากรุงดีลี เป็นเมืองติดทะเล อารมณ์เหมือนหาดชะอำ หรือหัวหินบ้านเรา นอกจากมีชายหาดที่ยาวแล้ว ยังมีท่าเรือที่เป็นช่องทางการส่งสินค้าเข้ามาในประเทศนี้ด้วย',
        logo2: 'https://topworldtraveling.com/img/images/15-best-places-to-visit-in-east-timor-timor-leste_6.jpg',
        title2: '2.  Maubisse',
        discription2: 'Maubisse เป็นหนึ่งในจุดท่องเที่ยวยอดนิยมที่สุดของติมอร์ตะวันออกสำหรับนักท่องเที่ยวชาวต่างชาติและผู้ที่อาศัยอยู่ใน Dili Pousada de Maubisse เป็นโรงแรมเพียงแห่งเดียวในเมืองที่มีทัศนียภาพอันงดงาม แต่ไม่ได้รับการปรับปรุงใหม่ตั้งแต่ปี 1950 อีกครั้งทุกที่ในติมอร์ตะวันออกคาดว่าจะได้รับประสบการณ์ที่น่าจดจำและการผจญภัยมากกว่าหนึ่งหรูหรา สำหรับนักปีนเขาที่กำลังวางแผนที่จะเดินป่า Ramelau, Maubisse เป็นเมืองที่ดีที่สุดสำหรับการพักในฐาน',
        credit: 'Credit : ' + 'https://travel.mthai.com'
      };
      this.namecountry = sendAEC;
    }
  }



  popForward() {
    this.navCtrl.pop();
  }
}
